{

	"users": [
		 {"id":1,"username":"user1","password":"user1"},
		 {"id":2,"username":"user2","password":"user2"},
		 {"id":3,"username":"user3","password":"user3"}	
	],

	"camp": [
		{"id":1,"title":"Ciwidey Valley Camping","location":"Ciwidey, Bandung, West Java","image":"img1"},
		{"id":2,"title":"Ranca Umpas Camping Ground","location":"Patengan, Rancabali, Bandung, West Java","image":"img2"},
		{"id":3,"title":"Taman Wisata Kaliurang","location":"Hargobinangun, Pakem, Sleman, DI Yogyakarta","image":"img3"},
		{"id":4,"title":"Hutan Wanagama4","location":"Playen,, Area Hutan, Gading, Gunung Kidul, DI Yogyakarta","image":"img4"},
		{"id":5,"title":"The Sila's Adventure Camp","location":"Candikuning, Baturiti, Tabanan, Bali","image":"img5"}
	],

	"guide": [
		{"id":1,"description_g":"          Camping is a fantastic way to explore the great outdoors, get some fresh air and spend quality time with friends and family. Camping for beginners and the inexperienced can be tricky, so here are our top tips to make your first time camping enjoyable and stress-free.\n\n\n   Choosing Your Campsite\n\n          There will be a large variety of campsites available to you for your first time camping. Things to look out for include whether they are considered ‘child friendly’, if dogs are allowed and the facilities such as toilets and showers that are available. As a beginner camper, it’s a good idea to book a campsite with high quality facilities and a town nearby so there are plenty of places to eat and buy supplies if you forget something.\n\n\n  Purchasing Your Tent\n\n            Tents come in all shapes and sizes and it’s important to choose one that’s right for you. When picking a tent, it’s a good idea to choose one that’s a size or two bigger than the number of people using it. This will allow enough room to store your gear in the tent and have comfortable space to sleep. If you’re unsure which tent is right for you, take a look at our tent guide\n\n\n" +
                "   Purchasing Sleeping Bags\n\n" +
                "           Whatever time of year you choose to camp it’s a good idea to bring a sleeping bag as temperatures can drop at night. When choosing a sleeping bag, pay attention to the season and temperature rating to ensure it will keep you at the optimum temperature for the time of year you choose to camp. Our sleeping bag guide gives an outline of all the important considerations when choosing a sleeping bag.\n\n\n" +
                "   Practice Pitching Your Tent\n\n" +
                "           One of the most important tips for your first time camping is to have a practice pitch of the tent at home. This will ensure you know how to put up and take down the tent and any problems can be solved while you’re at home, not at the campsite!\n\n\n" +
                "   Plan Your Meals Beforehand\n\n" +
                "           Planning what you’re going to eat and how you’re going to cook it can save a beginner camper a lot of time and hassle. Check campsite rules to see if you’re allowed campfires and research the local area for any pubs or restaurants where you can eat if things don’t go to plan!\n\n\n" +
                "   Have a Practice Camp\n\n" +
                "           Once you’ve had your practice pitch of the tent why not have a practice camp? Camping can be daunting for beginners but spending a night in the backgarden will help you judge the amount of layers you’ll need to wear and if your equipment is adequate.\n\n\n" +
                "   Make a Camping Essentials List\n\n" +
                "           Camping for beginners can be a challenge, particularly when you’re not sure of the type of equipment you need. For help, check out our camping equipment guide and make your own checklist to ensure nothing is left behind."
   }
		
	],

	"tutorial": [
		{"id":1,"title":"How To Set a Tent","description_t":"         Camping is a great activity in the summertime. Living out in a tent for a few days is a great opportunity to relax and get more in touch with nature. While it's a mostly fun activity, getting the tent itself together can be a real chore, especially if you're not used to the ins and outs of camping yet. Although it may seem tough at first, most tents are made with ease-of-install in mind. While assembling a tent is usually pretty straightforward, there's a lot more involved in making a successful campsite. Preparedness and scoping out the right location are essential before assembling the tent itself.",
    "image_t":"https://www.wikihow.com/images/thumb/d/d2/Assemble-a-Tent-Step-1-Version-2.jpg/aid97498-v4-728px-Assemble-a-Tent-Step-1-Version-2.jpg.webp"},
    
    
		{"id":2,"title":"1. Unpack your tent supplies","description_t":"        Once you've found a good area to set up camp, it's time to unpack your things. It's a good idea to pack all of the parts out at once. Assembling your tent will be fastest if you don't have to unpack each item one at a time. Keep all parts nestled in one place so you can keep account of everything. Because the list of supplies depends on the specific type of tent you're using, here are a few different types of tents you can consider:\n\n" +
                "       A-Frame tents are the most typical and common type of tent for personal use. They're the easiest to erect and usually come with extras like a rain-fly and weather tarp.\n\n" +
                "       Tunnel tents are different from typical \"A-Frame\" tents because they are structured by two long poles that both run the width of the tent. This creates a wider interior with more headspace. However, they're not nearly as stable when it comes to wind.\n\n" +
                "       Dome tents are generally the largest, and usually reserved for larger groups in camping. Although they're quite a bit bigger, they're generally very easy to pitch.",
                "image_t":"https://www.wikihow.com/images/thumb/d/d2/Assemble-a-Tent-Step-1-Version-2.jpg/aid97498-v4-728px-Assemble-a-Tent-Step-1-Version-2.jpg.webp"},
	
  
    {"id":3,"title":"2. Lay down a ground cloth","description_t":"          No matter how much you clear the area, there may still be twigs and other debris that could puncture your tent or make the surface otherwise uncomfortable. A ground cloth should be big enough to encompass the space of at least most of your tent. The added cushion of a ground cloth will lead to a more comfortable rest.",
    "image_t":"img3"},
		
    
    {"id":4,"title":"3. Insert your tent poles through the frame","description_t":"Once you've gotten all your tent parts out, slide the support poles through the body of the tent. Lie the tent frame out. That way, you can make sure you're sliding the poles through the right slots. This is arguably the most time-consuming part of tent assemblage, but it's very straightforward.\n\n" +
                "       In the case of a \"tunnel tent\", make sure the poles are parallel from one another.",
    "image_t":"img4"},
		
    
    {"id":5,"title":"4. Raise the tent","description_t":"           If the support poles have joints, make them rigid. The poles are going to have a pre-set frame to them for the main body of the tent. Help the tent up by lifting parts of it. The poles should hold the frame in place. If not, secure loose parts of the poles or extend them as needed.",
    "image_t":"img5"},
		
    
    {"id":6,"title":"5. Hammer in your tent pegs","description_t":"         Using a mallet or a nearby rock, take the spikes that come with your tent and hammer them into the ground. This will stabilize the tent and make sure it doesn't move around. If you don't have tent pegs for whatever reason, you can improve by using sturdy sticks and pushing them into the soil.","image_t":"img6"},
		{"id":7,"title":"6. Set up the rain-fly","description_t":"          It's important to keep in mind that tents on their own are usually not waterproof. This is where the rain-fly comes in. A rain-fly is an additional piece you set overtop the tent. There should be something along the line of latches on the roof of your tent to secure the rain-fly in place. Even if you're pretty sure there will be no rain, it doesn't hurt to install it nonetheless. It will ensure all of your tent equipment stays in one place, and prepare you for unforeseen rain showers.","image_t":"img7"},
		{"id":8,"title":"7. Move your things into the tent","description_t":"Once the tent is set up, you can equip the interior. Because there isn't usually much space in a tent, you should decide which things are alright to store outside, and which things should be kept inside. Sleeping bags are an obvious must in your tent. Crates and hard-cased storage can be left outside.\n\n" +
                "       If there's a risk of bears in the area you're camping, it is strongly recommended you keep food out of the tent. If a bear comes, you don't want him rummaging into your tent because he picked up the scent of granola.","image_t":"img8"},
    {"id":8,"title":"","description_t":"resource from : wikiHow","image_t":"img8"}
	]
}
